In [26]:
import pandas as pd

# Selecting a pandas Series from a DataFrame

In [27]:
ufo=pd.read_csv('https://raw.githubusercontent.com/jymishra/datasets/master/ufo.csv')

In [28]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [29]:
ufo.City.head(10)

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
5             Valley City
6             Crater Lake
7                    Alma
8                 Eklutna
9                 Hubbard
Name: City, dtype: object

In [30]:
type(ufo['City'])
type(ufo.City)

pandas.core.series.Series

# If column name contais space ...

In [31]:
ufo['Colors Reported'].head(10)

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
Name: Colors Reported, dtype: object

# Selecting Multiple Columns

In [32]:
ufo[['City','Colors Reported','State','Shape Reported']].head(10)

                   City Colors Reported State Shape Reported
0                Ithaca             NaN    NY       TRIANGLE
1           Willingboro             NaN    NJ          OTHER
2               Holyoke             NaN    CO           OVAL
3               Abilene             NaN    KS           DISK
4  New York Worlds Fair             NaN    NY          LIGHT
5           Valley City             NaN    ND           DISK
6           Crater Lake             NaN    CA         CIRCLE
7                  Alma             NaN    MI           DISK
8               Eklutna             NaN    AK          CIGAR
9               Hubbard             NaN    OR       CYLINDER

# Combine two Columns

In [33]:
ufo['Location']=ufo.City+'-'+ufo.State

In [34]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca-NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro-NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke-CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene-KS
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,New York Worlds Fair-NY

# Selecting Row/Cols Using iloc, loc, & ix

In [35]:
ufo.iloc[1,]

City                   Willingboro
Colors Reported                NaN
Shape Reported               OTHER
State                           NJ
Time               6/30/1930 20:00
Location            Willingboro-NJ
Name: 1, dtype: object

In [36]:
type(ufo.iloc[1,])

pandas.core.series.Series

In [37]:
ufo.iloc[1:5,2:4]

  Shape Reported State
1          OTHER    NJ
2           OVAL    CO
3           DISK    KS
4          LIGHT    NY

In [38]:
ufo.loc[1:3,['City','State','Shape Reported']]

          City State Shape Reported
1  Willingboro    NJ          OTHER
2      Holyoke    CO           OVAL
3      Abilene    KS           DISK

In [39]:
ufo.ix[1:3,3:5]

/Users/jymisra/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  State             Time
1    NJ  6/30/1930 20:00
2    CO  2/15/1931 14:00
3    KS   6/1/1931 13:00

In [40]:
ufo.iloc[0] # first row of data frame

City                       Ithaca
Colors Reported               NaN
Shape Reported           TRIANGLE
State                          NY
Time               6/1/1930 22:00
Location                Ithaca-NY
Name: 0, dtype: object

In [41]:

ufo.iloc[-1] # last row of data frame (Mi Richan)

City                           Ybor
Colors Reported                 NaN
Shape Reported                 OVAL
State                            FL
Time               12/31/2000 23:59
Location                    Ybor-FL
Name: 18240, dtype: object

In [42]:

ufo.iloc[:,0] # first column of data frame (first_name)

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
5                 Valley City
6                 Crater Lake
7                        Alma
8                     Eklutna
9                     Hubbard
10                    Fontana
11                   Waterloo
12                     Belton
13                     Keokuk
14                  Ludington
15                Forest Home
16                Los Angeles
17                  Hapeville
18                     Oneida
19                 Bering Sea
20                   Nebraska
21                        NaN
22                        NaN
23                  Owensboro
24                 Wilderness
25                  San Diego
26                 Wilderness
27                     Clovis
28                 Los Alamos
29               Ft. Duschene
                 ...
18211                 Holyoke
18212                  Carson
18213                Pasadena
18214                  Austin
18215                El Campo
18216            Garden Grove
18217           Berthoud Pass
18218              Sisterdale
18219            Garden Grove
18220             Shasta Lake
18221                Franklin
18222          Albrightsville
18223              Greenville
18224                 Eufaula
18225             Simi Valley
18226           San Francisco
18227           San Francisco
18228              Kingsville
18229                 Chicago
18230             Pismo Beach
18231             Pismo Beach
18232                    Lodi
18233               Anchorage
18234                Capitola
18235          Fountain Hills
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [43]:
ufo.iloc[:,1] # second column of data frame (last_name)

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
5           NaN
6           NaN
7           NaN
8           NaN
9           NaN
10          NaN
11          NaN
12          RED
13          NaN
14          NaN
15          NaN
16          NaN
17          NaN
18          NaN
19          RED
20          NaN
21          NaN
22          NaN
23          NaN
24          NaN
25          NaN
26          NaN
27          NaN
28          NaN
29          NaN
          ...
18211       NaN
18212       NaN
18213     GREEN
18214       NaN
18215       NaN
18216    ORANGE
18217       NaN
18218       NaN
18219       NaN
18220      BLUE
18221       NaN
18222       NaN
18223       NaN
18224       NaN
18225       NaN
18226       NaN
18227       NaN
18228       NaN
18229       NaN
18230       NaN
18231       NaN
18232       NaN
18233       RED
18234       NaN
18235       NaN
18236       NaN
18237       NaN
18238       NaN
18239       RED
18240       NaN
Name: Colors Reported, Length: 18241, dtype: object

In [44]:
ufo.iloc[:,-1] # last column of data frame (id)

0                      Ithaca-NY
1                 Willingboro-NJ
2                     Holyoke-CO
3                     Abilene-KS
4        New York Worlds Fair-NY
5                 Valley City-ND
6                 Crater Lake-CA
7                        Alma-MI
8                     Eklutna-AK
9                     Hubbard-OR
10                    Fontana-CA
11                   Waterloo-AL
12                     Belton-SC
13                     Keokuk-IA
14                  Ludington-MI
15                Forest Home-CA
16                Los Angeles-CA
17                  Hapeville-GA
18                     Oneida-TN
19                 Bering Sea-AK
20                   Nebraska-NE
21                           NaN
22                           NaN
23                  Owensboro-KY
24                 Wilderness-WV
25                  San Diego-CA
26                 Wilderness-WV
27                     Clovis-NM
28                 Los Alamos-NM
29               Ft. Duschene-UT
                  ...
18211                 Holyoke-MA
18212                  Carson-CA
18213                Pasadena-CA
18214                  Austin-TX
18215                El Campo-TX
18216            Garden Grove-CA
18217           Berthoud Pass-CO
18218              Sisterdale-TX
18219            Garden Grove-CA
18220             Shasta Lake-CA
18221                Franklin-NH
18222          Albrightsville-PA
18223              Greenville-SC
18224                 Eufaula-OK
18225             Simi Valley-CA
18226           San Francisco-CA
18227           San Francisco-CA
18228              Kingsville-TX
18229                 Chicago-IL
18230             Pismo Beach-CA
18231             Pismo Beach-CA
18232                    Lodi-WI
18233               Anchorage-AK
18234                Capitola-CA
18235          Fountain Hills-AZ
18236              Grant Park-IL
18237             Spirit Lake-IA
18238             Eagle River-WI
18239             Eagle River-WI
18240                    Ybor-FL
Name: Location, Length: 18241, dtype: object

In [45]:
ufo.iloc[0:4] # first four rows of dataframe

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,Ithaca-NY
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,Willingboro-NJ
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,Holyoke-CO
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,Abilene-KS

In [46]:
ufo.iloc[:, 0:2].head # first two columns of data frame with all rows

<bound method NDFrame.head of                        City Colors Reported
0                    Ithaca             NaN
1               Willingboro             NaN
2                   Holyoke             NaN
3                   Abilene             NaN
4      New York Worlds Fair             NaN
5               Valley City             NaN
6               Crater Lake             NaN
7                      Alma             NaN
8                   Eklutna             NaN
9                   Hubbard             NaN
10                  Fontana             NaN
11                 Waterloo             NaN
12                   Belton             RED
13                   Keokuk             NaN
14                Ludington             NaN
15              Forest Home             NaN
16              Los Angeles             NaN
17                Hapeville             NaN
18                   Oneida             NaN
19               Bering Sea             RED
20                 Nebraska             NaN
21                      NaN             NaN
22                      NaN             NaN
23                Owensboro             NaN
24               Wilderness             NaN
25                San Diego             NaN
26               Wilderness             NaN
27                   Clovis             NaN
28               Los Alamos             NaN
29             Ft. Duschene             NaN
...                     ...             ...
18211               Holyoke             NaN
18212                Carson             NaN
18213              Pasadena           GREEN
18214                Austin             NaN
18215              El Campo             NaN
18216          Garden Grove          ORANGE
18217         Berthoud Pass             NaN
18218            Sisterdale             NaN
18219          Garden Grove             NaN
18220           Shasta Lake            BLUE
18221              Franklin             NaN
18222        Albrightsville             NaN
18223            Greenville             NaN
18224               Eufaula             NaN
18225           Simi Valley             NaN
18226         San Francisco             NaN
18227         San Francisco             NaN
18228            Kingsville             NaN
18229               Chicago             NaN
18230           Pismo Beach             NaN
18231           Pismo Beach             NaN
18232                  Lodi             NaN
18233             Anchorage             RED
18234              Capitola             NaN
18235        Fountain Hills             NaN
18236            Grant Park             NaN
18237           Spirit Lake             NaN
18238           Eagle River             NaN
18239           Eagle River             RED
18240                  Ybor             NaN

[18241 rows x 2 columns]>

In [47]:
ufo.iloc[[0,3,6,24], [0,2,4]] # 1st, 4th, 7th, 25th row + 1st 3rf 5th columns.

           City Shape Reported            Time
0        Ithaca       TRIANGLE  6/1/1930 22:00
3       Abilene           DISK  6/1/1931 13:00
6   Crater Lake         CIRCLE  6/15/1935 0:00
24   Wilderness           DISK  1/1/1944 10:00

In [48]:
ufo.iloc[0:5, 1:4] # first 5 rows and 2nd, 3rd, 4th columns of data frame (county -> phone1).

  Colors Reported Shape Reported State
0             NaN       TRIANGLE    NY
1             NaN          OTHER    NJ
2             NaN           OVAL    CO
3             NaN           DISK    KS
4             NaN          LIGHT    NY